TS_setting.tex
% Created 2020-11-06 Jum 21:40
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{TC}
\date{2020-11-01}
\title{TS-setting}
\hypersetup{
 pdfauthor={TC},
 pdftitle={TS-setting},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Cara mengetahui service running}
\label{sec:org32ae477}
Untuk bisa mengetahui service yang sedang berjalan ada bebarapa perintah
bisa dilakukan 
\subsection{Mengetahui running untuk TS-Receiver}
\label{sec:org949d6fb}
Pada dasarnya setiap socket server yang berjalan untuk menerima data dari
perangkat merupakan sebuah script yang menjalankan sebuah aplikasi biner 
yang terdapat dalam folder Trumon. Nama file biner tersebut adalah TcpServerTS1.
Untuk bisa mengetahui running TS-Receiver anda bisa menggunakan perintah ps\footnote{ps atau process status merupakan program untuk mengetahui program yang sedang berjalan
link referensi \url{https://en.wikipedia.org/wiki/Ps\_(Unix)}}.
\begin{verbatim}
ps -axu | grep TcpServerTS1
\end{verbatim}
Untuk mengecek service yang berjalan pada bash anda bisa menggunakan perintah 
berikut. Biasanya service diletakan pada file script bash maka untuk bisa melihat 
status file bash sedang berjalan atau tidak bisa menggunakan perintah tersebut.
\begin{verbatim}
ps -aux | grep start_Recv4421.sh
ps -aux | grep start_Parser.sh
ps -aux | grep PM.sh
\end{verbatim}
\section{Menjalankan Aplikasi TS}
\label{sec:orgacb2a4f}
Beberapa file sebaiknya disimpan dalam direktori /home/\$\{USER\} dimana \$\{USER\} merupakan 
home direktori default ketika dan memasuki server melalui ssh.  Ada Folder yang bernama Trumon
dan pastikan beberapa file ada disana.
\begin{verbatim}
tree
\end{verbatim}
\subsection{Konfigurasi Socket Server}
\label{sec:orge58f61c}
Untuk melakukan konfigurasi socket server anda bisa mengedit bagian file berikut.
\subsection{Konfiguasi ImageReconstrution}
\label{sec:org320f557}
Image reconstruction digunakan untuk merubah file RAW yang merupakan Escape command menjadi 
file gambar (dalam format PNG)
\subsection{Konfigurasi OCR}
\label{sec:orgc5806e3}
OCR  digunakan untuk merubah file dari image kedalam bentuk text. Dalam pengembangannya 
Aplikasi TS pernah menggunakan aplikasi pihak ketiga. Beberapa kode terkadang diset oleh 
developer pihak ketiga atau menggunakan sebuah script yang dibuat prasimax untuk mengirimkan
data melalui perantara WEB-API. 
\subsection{Konfigurasi Parser}
\label{sec:org6cc751f}
Parser digunakan untuk memisahkan data teks kedalam beberapa komponent untuk bisa dimunculkan 
kedalam data transaksi.
\section{Stop Program}
\label{sec:org2835a95}
Beberapa methode bisa anda lakukan dengan untuk melakukan stop program. Anda bisa menggunakan
perintah top pada bash linux seperti contoh berikut untuk melihat aplikasi apa saja yang 
sedang berjalan di server
\begin{verbatim}
top
\end{verbatim}
top diatas bisa digunakan untuk mendapatkan nilai PID dari tiap aplikasi yang sedang berajalan.
Dan anda bisa menjalankan kill untuk menghentikan aplikasi 
\begin{verbatim}
kill -9 <pid>
\end{verbatim}
masukkan nilai <pid> dengan nilai pid yang tercantum dalam top atau ps -aux| grep <nama service>
Jika anda menggunakan ingin menghentikan perintah bash yang telah diekseksi terlalu banyak gunakan 
perintah berikut.

\begin{verbatim}
sudo killall sh
\end{verbatim}
Jika anda menemukan proses berikut
\begin{verbatim}
ps -axu | grep PM.sh
almar 9723  0.0  0.0  11272  940 pts/3  S+   21:32   0:00 grep --color=auto PM.sh
\end{verbatim}
maka anda telah mengekill semua proses sh. Dan satu satunya proses yang terdeteksi adalah proses
grep yang sedang mencari PM.sh yaitu ps -axu|grep PM.sh itu sendiri.
\section{Crontab}
\label{sec:org3c35d5d}
Jika anda ingin menjalankan program dalam crontab\footnote{Crontab untuk schedulin  \url{https://en.wikipedia.org/wiki/Cron}} anda bisa menggunakan script crontab berikut. 
Jika kode dibawah tidak bisa berjalan di server anda, anda bisa merubah file \$\{HOME\}
dengan login user yang anda miliki, pastinya ini dilakukan untuk bisa menjalankan schedule
pada aplikasi TS.
\begin{verbatim}
# engine pdc prasimax
 * * * * * /bin/sh /home/${HOME}/Trumon/PrintEmulator/PM.sh
 * * * * * /bin/sh /home/${HOME}/Trumon/Parser/start_Parser.sh
 * * * * * /bin/sh /home/${HOME}/Trumon/start_Recv3321.sh
 * * * * * /bin/sh /home/${HOME}/Trumon/start_Recv4421.sh
\end{verbatim}
\end{document}
